Revit 2026 API

# MacroManagerContains Method

---

Indicates the given module is a member of this collection.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Contains(
	MacroModule module
)
```
```vb
Public Function Contains (
	module As MacroModule
) As Boolean
```
```cpp
public:
bool Contains(
	MacroModule^ module
)
```
```fsharp
member Contains :
        module : MacroModule -> bool
```

#### Parameters

module MacroModule
     The module.

#### Return Value

Boolean Returns true if the given module is a member of this collection, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

MacroManager Class

Autodesk.Revit.DB.Macros Namespace